#add 添加元素
# s1 = {1, 2, 3, 4, 5}
# print("原集合", s1)  #原集合 {1, 2, 3, 4, 5}
# s1.add(6)   
# print("添加元素6后的集合", s1)  #添加元素6后的集合 {1, 2, 3, 4, 5, 6}
# s1.add(6,7,8,9)
# # 集合一次只能添加一个元素，不能同时添加多个元素，所以会报错
# print("添加元素6,7,8,9后的集合", s1)  #添加元素6,7,8,9后的集合 {1, 2, 3, 4, 5, 6}
# #update 更新集合


#  （）元组
# s2 = {1,2,3,4,5}
# print("原集合", s2)  #原集合 {1, 2, 3, 4, 5}
# # 把传入的元素拆分，一个个添加到集合中
# s2.update('6789')
# # s2.update((6,7,8,9))
# print("更新集合后的集合", s2)  #更新集合后的集合 {1, 2, 3, 4, 5, 6, 7, 8, 9}
# # 3.4.2 remove() 移除集合中的指定元素 

# 3  删除元素
# remove() 移除集合中的指定元素，如果元素不存在会报错
# s3 = {1, 2, 3, 4, 5}
# print("原集合", s3)  #原集合 {1, 2, 3, 4, 5}
# s3.remove(3)
# print("移除元素3后的集合", s3)  #移除元素3后的集合 {1, 2, 4, 5}
 
#  # pop() 随机移除集合中的一个元素，并返回被移除的元素，如果集合为空会报错
# s4 = {1, 2, 3, 4, 5}
# print("原集合", s4)  #原集合 {1, 2, 3, 4, 5}
# removed_element = s4.pop()
# print("被移除的元素", removed_element)  #被移除的元素
# print("移除元素后的集合", s4)  #移除元素后的集合 {2, 3, 4, 5}

# 4 discard() 移除集合中的指定元素，如果元素不存在不会报错
# s5 = {1, 2, 3, 4, 5}
# print("原集合", s5)  #原集合 {1, 2, 3, 4, 5}
# s5.discard(3)
# print("移除元素3后的集合", s5)  #移除元素3后的集合 {1, 2, 4, 5}
# s5.discard(6)  #元素6不存在，但不会报错
# print("移除元素6后的集合", s5)  #移除元素6后的集合 {1, 2, 4, 5}
  
#5  交集和并集
# 含义：共有的部分
a = {1, 2, 3, 4, 5}
b = {4, 5, 6, 7, 8}
print("集合a", a)  #集合a {1, 2, 3, 4, 5}
print("集合b", b)  #集合b {4, 5, 6, 7, 8}
print(a & b)
# intersection = a.intersection(b)
# print("交集", intersection)  #交集 {4, 5}     

# 并集
# print(a | b)
# union = a.union(b)
a = {1, 2, 3, 4, 5}
b = {4, 5, 6, 7, 8}
print(a | b)
print(type(a | b))  #<class 'set'> 结果是一个集合